{
    "First Name": "The user's first name is the personal identifier typically provided when creating their contact profile. It helps personalize interactions and communications.",
    "Last Name": "This represents the user's surname or family name as provided in their contact profile, which is important for formal and personalized communication.",
    "Tag": "Tags are keywords or labels assigned to a contact to categorize them based on attributes, behaviors, or interests. They help organize contacts for more targeted marketing.",
    "Birthdate": "The birthdate is the user's date of birth. It’s used for age verification, personalized birthday offers, or segmenting users based on age.",
    "Email": "This is the primary email address of the contact, typically used for communication, notifications, and marketing campaigns.",
    "Phone number": "The primary phone number of the contact, often used for customer support or communication via calls or SMS.",
    "Date of Addition": "The date when the contact was first added to the system. This helps track how long the contact has been in the database and may inform engagement strategies.",
    "City": "The city where the contact resides, which helps in segmenting users by geographic location for localized marketing or promotions.",
    "State": "The state or province where the contact lives. This information helps in segmenting users based on regions or regulatory needs.",
    "Country": "The country where the contact is based. It is often essential for compliance with local laws and tailoring content for specific regions.",
    "Language": "The preferred language of the contact, which ensures communication is in a language the customer understands and feels comfortable with.",
    "Amount spent in total": "The total monetary value that the customer has spent across all orders. This helps identify high-value customers for special offers or loyalty programs.",
    "Number of orders": "This is the total count of orders placed by the customer, which can give insight into their buying frequency and loyalty.",
    "Order status": "Indicates the current status of a customer’s order, such as pending, shipped, or completed, helping track the customer journey.",
    "Amount spent per order": "The average amount the customer spends on each order. This helps assess the purchasing behavior and can inform upsell strategies.",
    "Date of the order": "The date when a specific order was placed. This can help track order trends and the timing of purchases.",
    "Last Order Date": "This represents the most recent order placed by the customer. It’s a useful metric for understanding customer activity and engagement.",
    "Currency of the Order": "The currency used for the customer’s orders. This is important for international customers and financial reporting.",
    "Customer's language": "This shows the language preference of the customer, helping ensure the customer receives communication in their preferred language.",
    "Name of the product": "The name of the product purchased by the customer. Knowing what products customers are buying helps personalize future marketing and recommendations.",
    "ID of the product": "A unique identifier for each product, which helps track inventory, sales, and customer preferences more accurately.",
    "Total purchased": "This refers to the total quantity of a specific product purchased by the customer. It helps in understanding product popularity and customer demand.",
    "Abandoned Date": "The date when a customer abandoned their shopping cart. Tracking this can be useful for sending reminders or offering discounts to recover the sale.",
    "Abandoned product name": "The name of the product that was left in the cart but not purchased. This data helps in targeting customers for abandoned cart recovery campaigns.",
    "Abandoned product ID": "A unique identifier for the product left in the cart, allowing businesses to track abandoned items more efficiently.",
    "Total no. of abandoned carts": "The total number of carts abandoned by customers. This is a key metric for understanding cart abandonment rates and optimizing the checkout process.",
    "Amount in each abandoned cart": "The monetary value of the contents of an abandoned cart. This metric helps evaluate potential lost sales and identify high-value abandoned carts.",
    "Clicked on mail": "Indicates when a customer clicks on a link within an email campaign. This shows engagement with the content and can help track the success of email campaigns.",
    "Marked mail as spam": "This indicates that the recipient marked the email as spam. High rates of this behavior could affect deliverability and the sender's reputation.",
    "Mail delivery failed": "Indicates whether an email was successfully delivered or if it bounced. This is important for monitoring email deliverability and maintaining clean contact lists.",
    "Message sent": "Confirms that the email message was successfully sent to the recipient, ensuring that the communication process is complete.",
    "Opened message": "Indicates that the recipient opened the email message, signaling engagement and providing insights into the effectiveness of the subject line and timing.",
    "Opted in": "Shows that the recipient has opted into a communication or marketing campaign, indicating consent and interest in receiving emails.",
    "Opted out": "Indicates that the recipient has opted out of receiving further communication, which is essential for managing unsubscribes and complying with regulations.",
    "Viewed page": "Reflects that the recipient has viewed a page linked within an email, providing insight into the effectiveness of email calls-to-action and engagement.",
    "Automation Email Status": "Shows the current status of automated email campaigns (e.g., in progress, completed, or paused), helping businesses track the performance of their email automation.",
    "Contact present": "Indicates whether a specific contact is included in the list for a campaign. This helps track whether all intended recipients are included in outreach efforts."
  }